[{
  "title": "Eklund’s, Inc. Promotes Steve Johnson to National Sales Director",
  "posted": "07/23/2012",
  "image": "SteveJohnsonNews.jpg",
  "content": "<b>(DALLAS/FORT WORTH, Texas)</b> - Beth Cunningham, President of Eklund’s, Inc., has announced that Steve Johnson was recently named to the newly created position of National Sales Director.<br><br>\n\nAs National Sales Director, Mr. Johnson is charged with directing Eklund’s regional business development teams including Dallas/Fort Worth; Houston; Chicago, Kansas City, Las Vegas, and Baltimore-Washington, D.C. He will take an active role in maintaining sales goals, training, and fostering business development nation-wide.<br><br>\n\n\"As our first national sales director, Mr. Johnson will set a standard at the very highest level and will help lead this expanding company into the future,\" said Randy Richenberger, Vice President of Sales and Marketing.<br><br>\n\nMr. Johnson has over 20 years of experience in the manufacturing industry. Before joining Eklund’s in 2007 as a business development representative, he worked in sales at a Kansas City, Missouri based architectural metals company.<br><br>\n\nBorn and raised in the Kansas City, Missouri area, Mr. Johnson and his family relocated to Keller, Texas in July.<br><br>\n\nEklund´s, Inc. manufactures custom vertical transportation solutions including custom elevator cabs, interiors and entries, and a wide variety of specialty components. Founded in 1983, Eklund’s skilled craftsmen utilize state-of-the-art design and manufacturing techniques with long-lasting, serviceable and cost-efficient materials which meet the highest industry standards and the most stringent codes. Headquartered in Dallas/Fort Worth, Eklund’s serves the national building industry. Sales offices and design showrooms are located in Dallas/Fort Worth, Houston, Chicago, Kansas City, Las Vegas, and Baltimore-Washington, D.C. Manufacturing facilities are in Dallas/Fort Worth and Baltimore-Washington, D.C. Visit www.eklunds.com for more information and to explore our virtual Custom Cab Designer."
}, {
  "title": "Jason Speicher Joins Eklund's, Inc. as Northeast Regional Director",
  "posted": "09/23/2012",
  "image": "JasonSpeicherNews.jpg",
  "content": "<b>(DALLAS/FORT WORTH, Texas)</b> - Beth Cunningham, President of Eklund's, Inc., has announced the addition of Jason Speicher as Northeast Regional Director at the company's Lanham, Maryland custom elevator cab manufacturing facility.<br><br>\n\nIn his new role, Mr. Speicher is responsible for Eklund's business operations in the Northeast including overseeing manufacturing, improving processes, staffing, and field operations.<br><br>\n\nA veteran of the commercial and residential construction industry, Mr. Speicher has held several positions including Director of Construction and Senior Project Manager. Most recently he owned a carpentry facility in Monkton, Md.<br><br>\n\nMr. Speicher is a graduate of James Madison University in Harrisonburg, Va.<br><br>\n\nOriginally from western Pennsylvania, Mr. Speicher, his wife, and their two young boys live in Monkton, Md.<br><br>\n\nEklund's, Inc. manufactures custom vertical transportation solutions including custom elevator cabs, interiors and entries, and a wide variety of specialty components. Founded in 1983, Eklund's skilled craftsmen utilize state-of-the-art design and manufacturing techniques with long-lasting, serviceable and cost-efficient materials which meet the highest industry standards and the most stringent codes.<br><br>\n\nHeadquartered in Dallas/Fort Worth, Eklund's serves the national building industry. Sales offices and design showrooms are located in Dallas/Fort Worth, Houston, Chicago, Kansas City, Las Vegas, and Baltimore-Washington, D.C. Manufacturing facilities are in Dallas/Fort Worth and Baltimore-Washington, D.C. Visit www.eklunds.com for more information and to explore our virtual Custom Cab Designer."
}, {
  "title": "Richenberger Announces Resignation",
  "posted": "09/03/2013",
  "image": "",
  "content": "Randy Richenberger, Vice President of Business Development and Marketing, has announced his resignation from Eklund's, Inc.<br><br>\n\nEffective September 6, 2013, Randy departs to pursue an executive role with a laminate component manufacturing company where he will be working along-side his son.<br><br>\n\nWe are sad to see Randy go, as it's been a pleasure having him on our leadership team for the past 10+ years, but we are happy for the new opportunity he's been presented with. We wish him the best in his new endeavor!<br><br>\n\nSteve Johnson, Eklund's National Sales Director, who has worked alongside Randy for the past several years, and Beth Cunningham, President of Eklund's, are both standing by to assist customers with any needs.  Our Regional Business Development Representatives are always ready to help advise customers on cab solutions for upcoming projects and answer sales needs. Please keep the attached contact sheet for your files.<br><br>\n\nThank you for your business and continued support.<br><br>\n\nSincerely,<br><br>\n\nBeth Eklund Cunningham<br>\nPresident, Eklund's, Inc."
}, {
  "title": "Eklund's Opens New State-of-the-Art Elevator Cab Manufacturing Facility in Maryland, Servicing the Northeast Vertical Transportation Industry",
  "posted": "01/04/2011",
  "image": "",
  "content": "<b>Baltimore, Maryland</b> (January 5, 2011) - Eklund's, Inc. announces the opening of its second manufacturing, sales (and future showroom) facility located in the Baltimore-Washington, D.C. area. The new location features state-of-the-art equipment for designing and creating the highest level of elevator cabs, cab interiors, and architectural products for elevators, elevator entrances and escalators. Adding approx 20,000 sq. ft. of manufacturing space to its current capacity, Eklund's is positioning itself as the primary resource for total elevator cab solutions throughout the United States.<br><br>\n\nEklund’s provides the building industry with vertical transportation solutions, producing specialty elevator cabs and claddings including, glass observation, freight and service, and a wide variety of specialty components such as, custom elevator panels, ceilings and handrails. Their standard cab line is enhanced by the use of a custom cab designer, an on-line design tool that allows you to specify the interior components of an elevator cab in minutes (www.Eklunds.com). Eklund’s also provides qualified and licensed installation services through its entity, B.C.E. Specialties.<br><br>\n\nWith a second manufacturing facility on the east coast, Eklund’s will be able to better serve its customers by reducing costs while maintaining the high-tech production of its custom elevator cabs and shells. The new facility represents a significant investment by Eklund’s and re-affirms their status as a leader in total elevator cab solutions. Eklund’s provides a benchmark for the elevator cab industry through its dedication to continual process improvement, integration of current technology, as well as cost-effective materials and 3-D design offerings.<br><br>\n\nEklund’s president, Beth Cunningham, said, “We’re very excited about this addition to our manufacturing and sales capacity. By further enhancing our ability to provide superior customer service and create a larger platform from which we will continue to grow, we will be able to offer more efficient, cost-effective products to the east coast building industry. Our mission is to provide safe and aesthetically pleasing conveyance systems to modern organizations and businesses through the architectural design, manufacture and installation of elevator and escalator products.” <br><br>\n\nAbout Eklund’s, Inc.:<br>\nEklund's has been in business as a custom cab manufacturer and cab interior finish-out fabricator since 1984, founded by Jim Eklund, and currently owned and operated by his daughter, Beth Cunningham, making Eklund’s one of the few woman-owned business enterprises in the vertical transportation industry. Eklund’s has sales consultants and design showrooms located in Dallas/Fort Worth, TX, Chicago, IL, Kansas City, MO, Houston, TX, and Las Vegas, NV.<br><br>\n\nFor more information, please contact Eklund’s corporate headquarters at info@eklunds.com."
}]
