[{
  "title": "Ashton Steele, RPA, Senior Property Manager, Crescent Properties",
  "content": "I want to thank you for the exquisite work that you and your company designed and installed in our elevators at Johns Manville Plaza in Denver, Colorado. Our customers absolutely love the new interiors. The improvements have taken the building to the next level in class and quality.  Your team has been professional, courteous, and responsive throughout the entire process.",
  "image": "Crescent.png"

}, {
  "title": "Dejah Smith, Account Representative, Otis Elevator Co.",
  "content": "Otis Elevator Company has been partnering with Eklund’s extensively throughout the years.  From large projects in downtown Dallas with AT&T to smaller jobs with Thanksgiving Tower, all the customers have been extremely satisfied with their professionalism and product.  I am personally benefitting from the expertise of Eklund’s in that they provide my customers personal attention and solutions to their needs.  Eklund’s has met with the several members of the Board on more than three separate occasions to discuss their needs, vision and provide solutions to their concerns. Any concern or detail is never too small to address and Eklund’s welcomes the opportunity to excel in tough situations.  The detail and customer care that Eklund’s offers to their customer is priceless.  It is always a pleasure to work with them.",
  "image": "Otis.png"
}, {
  "title": "James W. Hardwick, General Manager, CB Richard Ellis",
  "content": "We are happy to write this letter of appreciation for the work Eklund’s provided on the new finishes for the elevator cabs at Lincoln Plaza.  Eklund’s participated in the planning from the start, and were helpful in provided cost information on various design scenarios.  Everything was completed on schedule.  Your level of service was outstanding, and when there were minor difficulties, your firm followed up and prevented them from becoming major problems.  We were glad to have your company to work with on this project and appreciate your performance through the design process.",
  "image": "CBRE.png"
}, {
  "title": "Roger Pickett, Property Manager, Cushman & Wakefield",
  "content": "Thank you for your company’s involvement in our most recent passenger elevator cab renovation. Our office, starting day one, received compliments one after another on the elevator finishes.  I think they especially liked the new ceiling and LED lights, which I recall was your idea.  It has been a pleasure dealing with Eklund’s.  Thanks, again, for a quality job.  We look forward to working with Eklund’s again at some point down the road.",
  "image": "Cushman.png"
}, {
  "title": "Scott Penovich, Eggers Industries",
  "content": "Eklund’s is a top-notch company to work with.  Beyond the common traits of being very knowledgeable and professional, Eklund’s takes it a step further by forming true partnerships with their vendors.  As a vendor, we never feel we are merely working FOR Eklund’s, but rather that we are working WITH Eklund’s to create the best possible product.  This true partnership is fostered by a high level of responsiveness and communication, as well as a strong mutual loyalty.  As a vendor, Eklund’s is an exceptional company with which to be partnered.",
  "image": "Eggers.png"
}, {
  "title": "Sophie Magness, Assistant Property Manager, Hines",
  "content": "I just wanted to say thanks for all your work on the elevator interiors!  They look great and your team was able to help us divert over 100 pounds of material from the dumpster!  The on-site crew was great and efficient and really helped me get through all the small nuances of ExxonMobil!  Thanks again.",
  "image": "Hines.png"
}]
